УТ/src/Catalogs/CRM_ИсточникиПолученияЛидов/CRM_ИсточникиПолученияЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ИсточникиПолученияЛидов</name>
  <comment>АПК:265 не проверять на орфографию имя</comment>
  <attributes>
    <name>CRM_UTM_medium</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_UTM_pos</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_UTM_source</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ВариантАвтосозданияКлиентов</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>EnumRef.CRM_ВариантыАвтосозданияКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ДлительностьОжиданияСвязыванияЗаявки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИдентификаторСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИспользоватьCallTracking</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИсточникЛидов</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИсточникПолученияАналитики</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиРекламныхКампаний</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НомерПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОбрабатыватьОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерГруппа</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерСтатусРаботы</name>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Сайт</name>
    <type>
      <types>CatalogRef.CRM_Сайты</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СоздаватьПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокЖизниОбращения</name>
    <comment>Время жизни обращения (дней)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УказыватьПричинуОтклонения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРасписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Включено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьГенераторЗаявки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьГенераторЗвонка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСтандартнаяОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПервичногоИнтереса</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаналПервичногоИнтереса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОбязательно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаДействия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПередаватьКонтактнуюИнформацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаОбязательно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКОбработке</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>EnumRef.CRM_CallTrakingСценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонОбязательно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабличнаяЧастьСопоставлениеРеквизитов</name>
    <attributes>
      <name>Выбрано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитПоиск</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитЗаголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>UTM_Метка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Пример</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитПользовательский</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеДанныеПоИсточникам</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Служебный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ПравилаОбработки</name>
    <attributes>
      <name>УсловиеОбработки</name>
      <type>
        <types>CatalogRef.CRM_УсловияОбработкиОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоОбработки</name>
      <type>
        <types>CatalogRef.CRM_ПравилаОбработкиОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Сценарии</name>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_ИсточникиПолученияЛидов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает массив источников лидов сценария.
//
// Параметры:
//  СценарийИнтереса - СправочникСсылка.CRM_СостоянияИнтересов	 - Сценарий интереса.
// 
// Возвращаемое значение:
//   - Неопределено, Массив
//
Функция ИсточникиЛидовСценария(СценарийИнтереса) Экспорт
	
	Если Не ЗначениеЗаполнено(СценарийИнтереса) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	CRM_ИсточникиПолученияЛидовСценарии.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_ИсточникиПолученияЛидов.CRM_Сценарии КАК CRM_ИсточникиПолученияЛидовСценарии
	                      |ГДЕ
	                      |	CRM_ИсточникиПолученияЛидовСценарии.Сценарий = &Сценарий
	                      |	И НЕ CRM_ИсточникиПолученияЛидовСценарии.Ссылка.ПометкаУдаления
	                      |	И CRM_ИсточникиПолученияЛидовСценарии.Ссылка.Включено
	                      |	И CRM_ИсточникиПолученияЛидовСценарии.Ссылка.CRM_ИсточникЛидов
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	CRM_УчетныеЗаписиМессенджеровСценарии.Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_УчетныеЗаписиМессенджеров.CRM_Сценарии КАК CRM_УчетныеЗаписиМессенджеровСценарии
	                      |ГДЕ
	                      |	CRM_УчетныеЗаписиМессенджеровСценарии.Сценарий = &Сценарий
	                      |	И НЕ CRM_УчетныеЗаписиМессенджеровСценарии.Ссылка.ПометкаУдаления
	                      |	И CRM_УчетныеЗаписиМессенджеровСценарии.Ссылка.Включена
	                      |	И CRM_УчетныеЗаписиМессенджеровСценарии.Ссылка.CRM_ИсточникЛидов
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	УчетныеЗаписиЭлектроннойПочтыСценарии.Ссылка
	                      |ИЗ
	                      |	Справочник.УчетныеЗаписиЭлектроннойПочты.CRM_Сценарии КАК УчетныеЗаписиЭлектроннойПочтыСценарии
	                      |ГДЕ
	                      |	УчетныеЗаписиЭлектроннойПочтыСценарии.Сценарий = &Сценарий
	                      |	И НЕ УчетныеЗаписиЭлектроннойПочтыСценарии.Ссылка.ПометкаУдаления
	                      |	И УчетныеЗаписиЭлектроннойПочтыСценарии.Ссылка.CRM_ИсточникЛидов
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	УчетныеЗаписиЭлектроннойПочтыСценарии.Ссылка");

	Запрос.УстановитьПараметр("Сценарий", СценарийИнтереса);
	МассивИсточников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Если ПроверитьОтборПоСценариюТелефония(СценарийИнтереса) Тогда
		МассивИсточников.Добавить(Неопределено);
	КонецЕсли;
	
	Возврат МассивИсточников;
	
КонецФункции

// Функция возвращает Истина, если отбор по сценарию "Телефония" установлен корректно.
//
// Параметры:
//  СценарийИнтереса - СправочникСсылка.CRM_СостоянияИнтересов	 - Сценарий интереса.
// 
// Возвращаемое значение:
//   - Булево
//
Функция ПроверитьОтборПоСценариюТелефония(СценарийИнтереса) Экспорт
	
	Если Не ЗначениеЗаполнено(СценарийИнтереса) Тогда
		Возврат Истина;
	КонецЕсли;
	
	СценарииОбработки = Константы.сфпНастройкиТелефонии_СценарииОбработки.Получить().Получить();
	Если СценарииОбработки = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	ИсточникОбращения = Новый Структура;
	ИсточникОбращения.Вставить("CRM_ИсточникЛидов", Константы.сфпНастройкиТелефонии_ИсточникЛидов.Получить());
	ИсточникОбращения.Вставить("СценарииОбработки",
		 Константы.сфпНастройкиТелефонии_СценарииОбработки.Получить().Получить());
	
	Если ИсточникОбращения.CRM_ИсточникЛидов Тогда
		
		Для Каждого СтрокаПравил Из ИсточникОбращения.СценарииОбработки Цикл
			Если СтрокаПравил.Сценарий = СценарийИнтереса Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#КонецЕсли
